// questionss object
const questions = {
    soal0: {
        text: "کدومش دلیل میخواد؟",
        image: "src/images/question-1-new.jpg",
        option0: {
            title: "رفتن",
            content: "تا کشور دلخواهم رو پیدا نکنم که نمیرم",
            value: 6,
            related: {
                au: 0,
                ie: 0,
                us: 0,
                gb: 0,
                nl: 0,
                dk: 0,
                fi: 0,
                se: 0,
                no: 0,
                at: 0,
                de: 0,
                be: 0,
                ch: 0,
                fr: 0,
                it: 0,
                es: 0
            }
        },
        option1: {
            title: "موندن",
            content: "شما به من بگو چرا بمونم من قول میدم بمونم!",
            value: 5,
            related: {
                au: 0,
                ie: 0,
                us: 0,
                gb: 0,
                nl: 0,
                dk: 0,
                fi: 0,
                se: 0,
                no: 0,
                at: 0,
                de: 0,
                be: 0,
                ch: 0,
                fr: 0,
                it: 0,
                es: 0
            }
        },
        option2: {
            title: "سیاسیش نکن!",
            content: "میرم که تجربه کنم، اصن شاید برگشتم. ببینم چی میشه",
            value: 3,
            related: {
                au: 0,
                ie: 0,
                us: 0,
                gb: 0,
                nl: 0,
                dk: 0,
                fi: 0,
                se: 0,
                no: 0,
                at: 0,
                de: 0,
                be: 0,
                ch: 0,
                fr: 0,
                it: 0,
                es: 0
            }
        },
        about: "way"
    },
    soal1: {
        text: "حاضری زبان جدید یاد بگیری؟",
        image: "src/images/question-2-new.jpg",
        option0: {
            title: "نه، اسمشم نیار!",
            content: "همین یه انگلیسی کافیه، قرار نیست هی زبون جدید یاد بگیرم که",
            value: 6,
            related: {
                au: 1,
                ie: 1,
                us: 1,
                gb: 1,
                nl: 1,
                dk: 1,
                fi: 1,
                se: 1,
                no: 0,
                at: 0,
                de: 0,
                be: 0,
                ch: 0,
                fr: 0,
                it: 0,
                es: 0
            }
        },
        option1: {
            title: "تجربه باحالیه",
            content: "چرا که نه، هر چی بیشتر بلد باشم که بهتره",
            value: 5,
            related: {
                au: 0,
                ie: 0,
                us: 0,
                gb: 0,
                nl: 0,
                dk: 0,
                fi: 0,
                se: 0,
                no: 1,
                at: 1,
                de: 1,
                be: 1,
                ch: 1,
                fr: 1,
                it: 1,
                es: 1,
            }
        },
        option2: {
            title: "یه کاریش میکنم حالا",
            content: "قاطی پاتی انگلیسی رو با زبان اونجا میبرم جلو کارم راه میافته",
            value: 3
        },
        about: "language"
    },
    soal2: {
        text: "همین الان اراده کنی کدوم رو میتونی بخری؟",
        image: "src/images/question-3-new.jpg",
        option0: {
            title: "آیفون 12 پرو مکس",
            content: "اصن میخوای بگم دو تا بیاره؟",
            value: 6,
            related: {
                ch: 1,
                no: 1,
                dk: 1,
                au: 1,
                ie: 1,
                fr: 1,
                se: 1,
                nl: 1,
                be: 0,
                fi: 0,
                at: 0,
                it: 0,
                us: 0,
                gb: 0,
                de: 0,
                es: 0
            }
        },
        option1: {
            title: "بستگی داره!",
            content: "اگه یارانه این ماه رو واریز کرده باشن که همه چی میتونم بخرم",
            value: 5,
            related: {
                ch: 0,
                no: 0,
                dk: 0,
                au: 0,
                ie: 0,
                fr: 0,
                se: 0,
                nl: 0,
                be: 1,
                fi: 1,
                at: 1,
                it: 1,
                us: 1,
                gb: 1,
                de: 1,
                es: 1
            }
        },
        option2: {
            title: "هر چی لازم باشه",
            content: "بالاخره چیزی لازم باشه یه جوری پولش رو جور میکنم",
            value: 3
        },
        about: "budget"
    },
    soal3: {
        text: "نبودن کدوم رو میتونی تحمل کنی؟",
        image: "src/images/question-1.png",
        option0: {
            title: "کولر و پنکه",
            content: "من ظرفیت گرماییم بالاست",
            value: 6,
            related: {
                au: 1,
                it: 1,
                es: 1,
                fr: 1,
                be: 1,
                ie: 1,
                nl: 1,
                us: 1,
                de: 0,
                gb: 0,
                dk: 0,
                at: 0,
                ch: 0,
                se: 0,
                fi: 0,
                no: 0
            }
        },
        option1: {
            title: "بخاری و شوفاژ",
            content: "فوقش دو لا لباس بیشتر می‌پوشم",
            value: 5,
            related: {
                au: 0,
                it: 0,
                es: 0,
                fr: 0,
                be: 0,
                ie: 0,
                nl: 0,
                us: 0,
                de: 1,
                gb: 1,
                dk: 1,
                at: 1,
                ch: 1,
                se: 1,
                fi: 1,
                no: 1,
            }
        },
        option2: {
            title: "یه کاریش می‌کنم حالا",
            content: "موجود وارسته‌ای هستم، فرقی برام نداره",
            value: 3
        },
        about: "weather"
    },
    soal4: {
        text: "هدفت اینه کدوم باشی؟",
        image: "src/images/question-4.png",
        option0: {
            title: "نفر آخر یه دانشگاه خوب",
            content: "مهم اینه که توی دانشگاه خوبی باشم",
            value: 6,
            related: {
                au: 1,
                dk: 1,
                no: 1,
                de: 1,
                ie: 1,
                us: 1,
                nl: 1,
                gb: 1,
                ch: 0,
                se: 0,
                fi: 0,
                be: 0,
                fr: 0,
                at: 0,
                es: 0,
                it: 0
            }
        },
        option1: {
            title: "نفر آخر یه دانشگاه داغون!",
            content: "دانشگاه مهم بود که تو ایرانم داریم کلی",
            value: 5,
            related: {
                au: 0,
                dk: 0,
                no: 0,
                de: 0,
                ie: 0,
                us: 0,
                nl: 0,
                gb: 0,
                ch: 1,
                se: 1,
                fi: 1,
                be: 1,
                fr: 1,
                at: 1,
                es: 1,
                it: 1
            }
        },
        option2: {
            title: "دست منه مگه؟",
            content: "ببینم کجا میتونم برم اصلا",
            value: 3
        },
        about: "knowledge"
    },
    soal5: {
        text: "مهمه برات که بقیه چطوری زندگی میکنن؟",
        image: "src/images/question-3.png",
        option0: {
            title: "صد البته",
            content: "اصن میخوام برم که توی یه محیط بهتر باشم",
            value: 6,
            related: {
                au: 0,
                ie: 0,
                us: 0,
                gb: 0,
                nl: 0,
                dk: 0,
                fi: 0,
                se: 0,
                no: 0,
                at: 0,
                de: 0,
                be: 0,
                ch: 0,
                fr: 0,
                it: 0,
                es: 0
            }
        },
        option1: {
            title: "چیکار دارم من!",
            content: "میخوام برم که از این محیط جدا بشم",
            value: 5,
            related: {
                au: 0,
                ie: 0,
                us: 0,
                gb: 0,
                nl: 0,
                dk: 0,
                fi: 0,
                se: 0,
                no: 0,
                at: 0,
                de: 0,
                be: 0,
                ch: 0,
                fr: 0,
                it: 0,
                es: 0
            }
        },
        option2: {
            title: "باز سیاسیش کردی!",
            content: "میخوام یه محیط جدید رو تجربه کنم",
            value: 3
        },
        about: "food"
    }
};
// country results
const country = {
    5555: {
        name: "بلاروس",
        image: "belarus",
        code: "by",
        content: "بلاروس کشور سر سبزی است که 40 درصد مساحت آن با جنگل پوشیده شده است. مردم بلاروس باورهای جالبی دارند. مثلا اعتقاد دارند که در خانه نباید سوت زد، چون باعث می‌شود پول از دست بدهید. یا پس از رفتن مهمان از خانه، تا رسیدن مهمان به خانه‌اش، خانه را تمیز نمی‌کنند. زیرا که باور دارند در این صورت آن مهمان از زندگی آن‌ها پاک خواهد شد.\n" +
            "کشور بلاروس به لحاظ موقعیت جغرافیایی در شمال شرقی اروپا واقع شده است. از شمال غرب با لیتوانی و از جنوب غرب با اوکراین، از شرق با روسیه و از غرب با لهستان همجوار است. شهر مینسک با جمعیتی حدود 2 میلیون نفر جز مهمترین شهرهای بلاروس و پایتخت این کشور است. این شهر با ظاهری امروزی و جوان خود دارای خیابان‌های تمیز، گیاهان سر سبزو میدان‌های زیبا است. ولی مهمتر از همه ساکنان مهربان و مهمان‌نواز این شهر هستند که بر زیبایی شهر افزوده است.\n" +
            "کشور بلاروس به دلیل نزدیکی به دریای بالتیک، از آب و هوای معتدلی برخوردار است. فصل تابستان در کشور بلاروس بیش از ۱۵۰ روز در سال طول می کشد. با این حال دمای هوای کشور بلاروس در فصل زمستان برای مدت کوتاهی به ۲۵- درجه سانتی گراد نیز می رسد. زمستان های کشور بلاروس بسیار معتدل تر از زمستان های بخش اروپایی در شرق است.\n" +
            "هر دو زبان روسی و بلاروسی در این کشور تکلم می‌شود. اما روسی زبان اصلی کشور است که حدود 70 درصد مردم به این زبان صحبت می‌کنند. سطح فراگیری زبان انگلیسی مردم بلاروس پایین و در حد مردم روسیه و اسپانیا است.\n" +
            "دانشگاه دولتی علوم پزشکی بلاروس، دانشگاه فنی ملی دولتی بلاروس و دانشگاه ملی دولتی از جمله دانشگاه‌های این کشور هستند.\n"
    },
    5556: {
        name: "چک",
        image: "czech",
        code: "cz",
        content: "مردم چک خیلی به نظم و برنامه‌ریزی علاقه ندارند. شاید دلیلش این است که مراسم زیادی برای جشن گرفتن دارند. به همین خاطر به خوردن و نوشیدن خیلی اهمیت می‌دهند.  جمعیت مهاجرین ساکن چک زیاد است. از طرفی چک هفتمین کشور امن دنیا برای زندگی شناخته شده است. \n" +
            "جمهوری چک واقع در اروپای مرکزی است که در دهه ۱۹۹۰ میلادی از کشور چکسلواکی جدا شد. پایتخت و بزرگترین شهر جمهوری چک شهر پراگ است. چک با لهستان، آلمان، اتریش و اسلواکی همسایه است. چک تنوع آب و هوایی زیادی دارد. اما به طور کلی چک تابستان‌های گرم و  زمستان‌های سرد و آسمان ابری دارد.\n" +
            "این کشور مملو از بهترین تاکستان‌‌ها و قصرهای زیبا است. چک محل برخورد تمدن‌های اروپایی است. این کشور دارای منابع طبیعی و فرهنگی منحصر به فردی است و به عروس اروپا معروف است\n" +
            "زبان رسمی این کشور چکی است. مردم چک همواره در طول تاریخ به عنوان مردمی «بی‌اعتنا به مذهب» توصیف شده‌‌اند. میزان فراگیری زبان انگلیسی در میان مردم چک نسبتا خوب است و هم‌سطح سوئیس است.\n" +
            "از دانشگاه‌های این کشور می‌توان به دانشگاه چارلز (قدیمی‌ترین دانشگاه اروپای مرکزی) با رتبه‌ 260 در QS، دانشگاه ماساریک با رتبه 531 و دانشگاه فنی چک در پراگ با رتبه 432 اشاره کرد.\n"
    },
    5565: {
        name: "استونی",
        image: "estonia",
        code: "ee",
        content: "در استونی تعداد زن‌ها بیشتر از مردان است. به همین خاطر لقب کشور زنانه داده شده است. برای کسانی که اهل ماجراجویی هستند استونی گزینه بسیار مناسبی است، زیرا دریاچه‌های فراوان و جنگل‌های متراکم زیادی در آن به چشم می‌خورد.\n" +
            "استونی كوچك‌ترین و شمالی‌ترین كشور منطقه بالتیك بوده و از تعداد زیادی جزیره در ساحل جنوبی خلیج فنلاند تشكیل شده است. در این كشور، دریاچه‌های فراوان و جنگل‌های متراكم زیادی به چشم می‌خورد. استونی، از نظر منابع طبیعی فقیر است و خاک آن قابلیت كشت مناسبی ندارد. دامداری آن نیز فقط جوابگوی 20 درصد نیاز كشور است. با این حال شاخص رفاه مردم استونی تقریبا همرده‌ی مردم فرانسه و آمریکا است.\n" +
            "آب و هوای استونی معتدل و مرطوب با تابستان‌های ملایم و زمستان‌های سرد است. بیشترین دمای این کشور حدود ۱۸ درجه سانتی‌گراد در ماه جولای و کمترین دما منفی 7.5 در فوریه است. \n" +
            "زبان استونیایی به زبان فنلاندی نزدیک است و از معدود زبان‌های با ریشه‌ی غیر هندی و اروپایی است. متداول‌ترین زبان‌های خارجی در استونی روسی، انگلیسی، آلمانی و فرانسه است. میزان نفوذ زبان انگلیسی در میان مردم استونی در مقایسه با سایر کشورهای اروپا در سطح متوسطی (تقریبا همانند کشور فرانسه) است. \n" +
            "دانشگاه تالین، دانشگاه تیلور و دانشگاه تارتو از جمله دانشگاه‌های معتبر استونی هستند که در رتبه‌بندی‌های جهانی، جایگاه خوبی دارند.\n"
    },
    5566: {
        name: "چین",
        image: "china",
        code: "cn",
        content: "اگر تمام خطوط ریلی چین را به هم متصل کنیم، به اندازه دوبار دور کره زمین خواهد شد. با وجود پهناوری زیاد چین، اما ساعت رسمی در تمام چین، یک ساعت مشخص است. مردم چین بسیار اهل سفر هستند و بستنی، یکی از اختراعات آنان است. سرعت ساخت و ساز در چین بسیار بالاست و هر پنج روز یک آسمان‌خراش ساخته می‌شود.\n" +
            "کشور چین با نام رسمی جمهوری خلق چین‏، پرجمعیت‌ترین کشور دنیا با بیش از ۱٫۳ میلیارد نفر سکنه‌ است.  این کشور که در شرق قاره آسیا واقع شده است. علیرغم جمعیت زیاد همچنان نیمی از خاک چین خالی از سکنه است.  \n" +
            "آب‌و‌هوای چین به دلیل گستردگی و وسعت این کشور بسیار متنوع است. زمستان در شمال چین در کوه‌ها و فلات‌ها برفی و یخبندان، در حالی که در جنوب میزان سرما خفیف‌تر بوده و تابستان در همه جای چین به جز در ارتفاعات و کوه‌های مرتفع گرم است. \n" +
            "زبان رسمی چین، ماندارین است که یکی از سخت‌ترین زبان‌های دنیاست. اما سطح فراگیری زبان انگلیسی نزد مردم چین در سطح متوسط است. کمی کمتر از مردم کره‌جنوبی و بیشتر از مردم هند.\n" +
            "در لیست صد دانشگاه برتر دنیا، 6 دانشگاه از چین به چشم می‌خورد. در این کشور پهناور دانشگاه‌های معتبری در سطح بین‌المللی وجود دارد. دانشگاه پکن با رتبه 23 در QS، دانشگاه تسینگوا با رتبه 15 و آکادمی علوم چین با رتبه 93 از جمله این دانشگاه‌ها هستند.\n"
    },
    5655: {
        name: "اسلوونی",
        image: "slovenia",
        code: "si",
        content: "شاید به همان اندازه که مردم هند به گاو احترام می‌گذارند، مردم اسلوونی نیز به زنبورها علاقمندند. تا جایی که زنبور و زنبورداری در حد یک دین برای مردم اسلوونی محترم است. نیمی از مساحت اسلوونی پوشیده از جنگل است و به سبب همین پوشش گیاهی قوی، پرورش زنبور در این کشور بسیار رونق دارد.\n" +
            "این کشور در جنوب شرقی اروپا مرکزی واقع شده است. از شمال با اتریش، از جنوب با کرواسی، از شرق با مجارستان و از غرب با ایتالیا همسایه است. اسلوونی زمانی جزء یوگسلاوی بود تا اینکه با انحلال این کشور در سال 1991 به صورت کشوری مستقل درآمد.\n" +
            "با وجود پوشش کوه‌ها در شمال این کشور آب و هوای اسلوونی سرد و کوهستانی است. اما جنوب کشور از آب و هوای معتدل و مدیترانه‌ای برخوردار است.\n" +
            "اسلوونیایی زبان رسمی این کشور است. اگرچه بسیاری از دانشگاه‌ها برنامه‌ها و رشته‌هایی را به صورت کاملا انگلیسی ارائه می‌دهند. دانشگاه لیوبلیانا، دانشگاه ماریبور و دانشگاه نوا گوریکا سه دانشگاه برتر این کشور هستند.\n"
    },
    5656: {
        name: "لهستان",
        image: "poland",
        code: "pl",
        content: "کلاه به سر داشتن در داخل خانه در لهستان نشانه‌ی بی‌ادبی است. فیلم‌های خارجی در لهستان تنها توسط یک نفر دوبله می‌شود که به جای تمام کاراکترها (چه زن و چه مرد) صحبت می‌کند. لهستانی‌ها جز مذهبی‌ترین مردم اروپا محسوب می‌شوند و مثل ایرانی‌ها لهستانی‌ها نیز با سنت و آیین مختص به خودشان به استقبال بهار می‌روند. \n" +
            "لهستان کشوری در مرکز اروپاست که در همسایگی با آلمان، چک، اسلواکی، اوکراین، بلاروس، لیتوانی و روسیه است. لهستان بعنوان قلب و شاهراه ارتباط شرق و غرب اروپا شناخته می‌شود.\n" +
            "لهستان دارای زمستان‌‌های نه چندان سرد و نسبتا طولانی تر نسبت به تابستان است. کمترین دما در ژانویه (بین منفی پنج تا سه درجه) و بیشترین دما در ماه جولای (بین 14 تا 26 درجه) است.\n" +
            "زبان رسمی مردم لهستان، پولیش یا همان لهستانی است اما مردم این کشور به‌خصوص جوان‌ترها به زبان انگلیسی مسلط بوده و به راحتی با شما ارتباط برقرار خواهند کرد.\n" +
            "از دانشگاه‌های برتر این کشور می‌توان دانشگاه ورشو با رتبه 394 در QS، دانشگاه جانگولیان با رتبه 411 و دانشگاه فنی ورشو با رتبه 601 را نام برد.\n"
    },
    5665: {
        name: "ایسلند",
        image: "iceland",
        code: "is",
        content: "این کشور غربی‌ترین کشور اروپایی است و دیرتر از سایر کشورها پای بشر به آن رسیده است. مردم این کشور بسیار شاد و پویا هستند و بنابر نظر سنجی‌ها ایسلندی‌ها خوشبین‌ترین مردم در دنیا است. ایسلند ارتش دائمی ندارد و میزان جرم و جنایت در این کشور تنها 3 درصد اعلام شده است. اگرچه میزان ساعت کاری در هفته بالاست اما مردم این کشور بسیار خوشگذران هستند. به طوریکه همواره آخر هفته را خارج از منزل می‌گذرانند. مشاهده نهنگ یکی از تفریحات مردم ایسلند است. \n" +
            "ایسلند جمعیت بسیار کمی (کمتر از 400 هزار نفر) دارد و از هر ده نفر یک نفر در این کشور کتاب چاپ کرده است. ورزش مورد علاقه‌ی ایسلندی‌ها، هندبال است.\n" +
            "ایسلند از یک جزیره بزرگ و چندین جزیره کوچک تشکیل شده است. اقتصاد این کشور وابسته به ماهیگیری است و حدود 39 درصد از مردم در زمینه ماهیگیری فعالیت می‌کنند.\n" +
            "آب و هوای کشور ایسلند سرد است. به دلیل میزان زیاد بارش باران، رودخانه‌ها و دریاچه‌های بسیاری در این کشور وجود دارد.\n" +
            "از دانشگاه‌های این کشور می‌توان به دانشگاه ایسلند، دانشگاه ریکیاویک و دانشگاه Akureyri اشاره کرد که البته در رتبه‌بندی‌های جهانی، جایگاه متوسطی دارند.\n"
    },
    5666: {
        name: "کانادا",
        image: "canada",
        code: "ca",
        content: "کشوری که بیش از ۸۲ درصد جمعیت آن از شرایط زندگی خود رضایت کامل دارند، کمترین میزان گزارش جرم و جنایت در دنیا را داراست و سیاست‌های جمعیتی خود را بر اساس مهاجرت نیروی انسانی متخصص و کارآمد چیده است. به همین خاطر است که کانادا یکی از بهترین مقاصد برای زندگی، کار و تحصیل است. این کشور دومین کشور بزرگ دنیا از نظر مساحت است که 99 درصد مردم آن باسواد و بیش از نیمی از مردم آن تحصیل کرده‌اند.\n" +
            "کانادا شمالی‌ترین کشور قاره‌ی آمریکا است که تنها یک همسایه (ایالت متحده آمریکا) دارد. شاید یکی از اصلی‌ترین چالش‌های مربوط به زندگی در این کشور آب و هوای آن باشد. به طور کلی زمستان‌های کانادا به نسبت سایر فصل‌ها سردتر و به طبع آن سخت‌تر است. آب و هوای تورنتو کمی خنک‌تر از سایر مناطق شمال شرقی این کشور است. تابستان‌های انتاریو گرم و شرجی است. اما آب و هوای ونکوور به مراتب از سایر مناطق بهتر است.\n" +
            "زبان‌های رسمی کانادا، انگلیسی و فرانسوی است. بیشتر جمعیت فرانسوی زبان کانادا در کبک زندگی می‌کنند.\n" +
            "دانشگاه‌های این کشور از معتبرترین های جهان هستند، دانشگاه مک‌گیل با رتبه 30 در QS، دانشگاه تورنتو با رتبه 32 و دانشگاه بیریتیش کلمبیا با رتبه 45 از جمله دانشگاه‌های مطرح این کشور هستد.\n"
    },
    6555: {
        name: "فیلیپین",
        image: "philippines",
        code: "ph",
        content: "فیلیپین زمانی مستعمره‌ی اسپانیا بود و نام این کشور از اسم فیلیپ دوم، پادشاه اسپانیا گرفته شده است. این کشور از 7641 جزیره تشکیل شده است که بیشتر آن‌ها غیرقابل سکونت هستند. تقریبا ۸۰ درصد از جمعیت فیلیپین را کاتولیک‌ها تشکیل داده‌اند. به این ترتیب، سومین شهر پر کاتولیک جهان پس از برزیل و مکزیک بشمار می‌رود. \n" +
            "کشور فیلیپین بزرگترین مجمع‌الجزایر دنیا است و در جنوب شرقی آسیا واقع شده است. فیلیپین کاملا محصور در دریاست و هیچ مرز خاکی‌ای ندارد. کشورهای نزدیک به فیلیپین، اندونزی، مالزی، تایوان، چین و ویتنام است.\n" +
            "آب و هوای فیلیپین گرمسیری دریایی با رطوبت زیاد است. در طول سال همواره با طوفان و باران‌های موسمی روبرو است و جنگل‌های سرسبز استوایی این کشور را فرا گرفته‌ است. دمای هوا بین ۲۰ تا ۴۰ درجه متغیر است. وقوع زمین‌لرزه در این جزایر پدیده‌ای معمولی به‌شمار می‌آید.\n" +
            "زبان مردم فیلیپین تاگالوگ است. اما مردم کشور فیلیپین به زبان انگلیسی نیز صحبت می‌کنند و سطح فراگیری زبان انگلیسی در این کشور بالاست.\n" +
            "از دانشگاه ‌برتر این کشور می‌توان به دانشگاه فیلیپین با رتبه 367 در رتبه‌بندی جهانی، دانشگاه اتنئو دی مانیلا با رتبه‌‌ی 551 و دانشگاه دی‌لا‌ساله با رتبه 701  اشاره کرد.\n"
    },
    6556: {
        name: "ترکیه",
        image: "turkey",
        code: "tr",
        content: "ترکیه محل تولد سنت نیکولاس است که شخصیت بابانوئل اشاره به او دارد. دومین راه‎آهن زیرزمینی دنیا متعلق به ترکیه است و مورخان بر این باورند که کشاورزی از ترکیه شروع شده است. امروزه نیز این کشور یکی از ده کشور برتر در زمینه تولید غلات به شمار می‌رود.\n" +
            "95 درصد از خاک ترکیه در آسیا (آناتولی) و 5 درصد آن در اروپا قرار دارد. این کشور از شمال غرب با بلغارستان و یونان، از شرق با ایران، ارمنستان و آذربایجان، از جنوب با سوریه و از شمال شرقی با گرجستان هم مرز است. \n" +
            "بسیاری از نواحی این کشور کوهستانی هستند و آب و هوای خنک و بارانی دارند. این ویژگی های طبیعی باعث شده اند ترکیه کشوری سرسبز با سواحلی زیبا باشد.\n" +
            "ترکی استانبولی به عنوان یکی از گویش‌های زبان ترکی، زبان اصلی مردم ترکیه است. سطح فراگیری زبان انگلیسی در میان مردم ترکیه پایین است.\n" +
            "از دانشگاه‌های مطرح این کشور می‌توان به دانشگاه وکوچ با رتبه 465 در QS، دانشگاه سابانچی با رتبه 521 و دانشگاه بیلکنت با رتبه 551 اشاره کرد.\n"
    },
    6565: {
        name: "مالزی",
        image: "malaysia",
        code: "my",
        content: "مالزی بیش از ۶۵ هزار کیلومتر بزرگراه داشته که بیشتر از محیط کره زمین است. همچنین بزرگترین میدان دنیا نیز در مالزی است که قطر آن 3.5 کیلومتر است.\n" +
            "مالزی یکی از کشورهای جنوب شرقی آسیا و پایتخت آن کوالالامپور است. این کشور با برونئی، اندونزی و تایلند همسایه است. مالزی به خاطر سواحل متعدد و تنوع جاذبه‌های طبیعی و شهری، یکی از مهم‌ترین مقاصد گردشگری دنیا است. مالزی در نزدیکی خط استوا قرار گرفته و دارای آب و هوای استوایی است و در تمام طول سال هوا گرم و مرطوب است. بارش باران در مالزی زیاد و میانگین دمای هوا ۲۷ درجه‌ی سانتی‌گراد است.\n" +
            "زبان اصلی مالزی زبان مالایایی با خط انگلیسی است. در اصل زبان مالایایی به خط فارسی نوشته می‌شد، اما به دلیل استعمارات بریتانیا اکثر مردم زبان مالایایی را با خط انگلیسی می‌نویسند. میزان فراگیری زبان انگلیسی میان مردم مالزی متوسط رو به بالاست.\n" +
            "مالزی کشور فرهنگ‌ها و اقوام مختلف است و این تنوع یکی از جذاب‌ترین بخش‌های آن محسوب می‌شود. جشن سال نوی چینی‌ها، جشنواره روشنایی هندوها، جشن عید فطر مسلمانان مالزی، روز وساک بودائی‌ها، جشن کریسمس مسیحیان، جشن گاوای دایاک و فستیوال فانوس مالزی از جمله مهم‌ترین جشنواره‌های این کشور هستند.\n" +
            "از دانشگاه‌های این کشور می‌توان به دانشگاه مالزی با رتبه 205 در رتبه‌بندی جهانی، دانشگاه فناوری مالزی با رتبه 486 و دانشگاه علوم مالزی با رتبه 580 اشاره کرد.\n"
    },
    6566: {
        name: "هند",
        image: "india",
        code: "in",
        content: "در هند نباید کتاب، کاغذ و یا حتی روزنامه را با پا لگد کرد و یا جابه جا کرد. یا اینکه نباید با همان دستی که غذا می خورید، از ظرف اصلی برای خود غذا بکشید!\n" +
            "هند، یکی از کشورهای پر جمعیت آسیایی است که بین اقیانوس هند و رشته‌کوه هیمالیا قرار گرفته است. هند با پاکستان، چین، نپال و بنگلادش همسایه است. بیشتر ایام سال هوای هند گرم است. گرم‌ترین ماه‌ها اواخر مارس تا می است. دسامبر تا فوریه دمای هوا کمی سرد می‌شود. \n" +
            "زبان رسمی این کشور هندی و انگلیسی است و گاهی زبان‌های بنگالی و پنجابی هم در هند صحبت می‌شود.\n" +
            "هند دارای دانشگاه‌های معتبریست که می‌توان به دانشگاه دهلی با رتبه 248 در رتبه‌بندی جهانی، موسسه فناوری کانپور و موسسه فناوری بمبئی اشاره کرد.\n"
    },
    6655: {
        name: "عمان",
        image: "oman",
        code: "om",
        content: "عمان با سابقه‌ترین کشور مستقل جهان عرب است. سطح امنیت عمان بسیار بالاست و یکی از بزرگترین کشتی‌سازان جهان است. در عمان برای خرید الکل نیاز است که از پلیس مجوز دریافت کنید. نوشیدنی اصلی آن‌ها قهوه است و بسیار مهمان‌نوازند.\n" +
            "عمان کشوری پادشاهی در سواحل خلیج فارس و در جنوب ایران است. آب و هوای عمان بیابانی گرمسیری است و می‌توان گفت که شبیه به شهرهایی مانند دبی و لاپاز (مکزیک) است. تابستان بسیار گرم و مرطوب است و دمای هوا در طول روز به ۳۸ درجه سانتی‌گراد می‌رسد. بهار و پاییز نیز تقریبا گرم هستند که در شب دما حدود ۲۱ درجه سانتی‌گراد است.\n" +
            "عربی زبان رسمی مردم در عمان است و سطح فراگیری انگلیسی در این کشور ضعیف است. مردم مختلفی از اقصا نقاط دنیا در عمان زندگی می‌کنند و می‌توان گفت که ساکنان عمان ترکیبی از هندی، پاکستانی و اعراب است. \n" +
            "از دانشگاه‌های برتر این کشور می‌توان به دانشگاه سلطان قابوس با رتبه 375 در QS، دانشگاه نزوا و دانشگاه صنعتی المصنعه اشاره کرد.\n"
    },
    6656: {
        name: "تایوان",
        image: "taiwan",
        code: "tw",
        content: "تایوانی‌ها همیشه با چاپستیک غذا میخورند. یادتان  باشد که هرگز چاپستیک را به صورت عمودی در غذا نگه ندارید. این کار سمبلی برای مرگ است! \n" +
            "تایوان به دلیل بازارهای شلوغ شبانه‌اش معروف است. فراموش نکنید در تایوان برای خوشامدگویی دست بدهید. برخلاف تصور عموم، تایوانی‌ها مثل ژاپنی‌ها و کره‌ای‌ها برای خوشامدگویی تعظیم نمی‌کنند. \n" +
            "کشور تایوان جزیره‌ای کوچک در 180 کیلومتری شرق کشور چین است. نام دیگر جزیره‌ی زیبای تایوان، چین تایپه است .این کشور یکی از مراکز مهم اقتصادی آسیا است که پایتخت آن شهر تایپه است و در شمال تایوان قرار دارد. تایوان با کشورهای چین در غرب، فیلیپین در جنوب و ژاپن در شمال شرقی همسایه است.\n" +
            "زبان اصلی مردم تایوان، زبان چینی است. سطح فراگیری زبان انگلیسی در میان مردم تایوان متوسط رو به پایین و در حد کشورهایی مانند مغولستان و افغانستان است.\n" +
            "شهر تایپه به طور کلی آب و هوایی گرم و مرطوب دارد. گرم ترین ماه های این شهر، ماه ژوئن تا آگوست است که دمای هوا در آن تا ۳۸ درجه می‌رسد. ماه‌های ژوئن تا اکتبر معمولا بادهای سنگینی در این شهر می‌وزد.\n" +
            "از دانشگاه‌های برتر این کشور می‌توانیم دانشگاه ملی تایوان با رتبه 66 در QS، دانشگاه چینهوا با رتبه 168 و دانشگاه سون یات سن با رتبه 416 را نام ببریم.\n"
    },
    6665: {
        name: "عربستان سعودی",
        image: "saudi-arabia",
        code: "sa",
        content: "بین سعودی ها یک داستان مرسوم وجود دارد که می گوید وقتی وینستون چرچیل در حال تعیین مرز بین عربستان و اردن بوده، از شدت مستی، سکسکه کرده و دست‌های او دچار لرزش می‌شود. همین موضوع باعث می شود تا او سهوا چند هزار کیلومتر مربع از زمین‌های نه چندان با ارزش اردن را به عربستان اختصاص دهد. از همین رو این تکه از زمین‌های عربستان امروز در بین عرب‌ها سکسکه چرچیل نامیده می‌شود.\n" +
            "عربستان سعودی در غرب قاره آسیا قرار دارد. کشورهای اردن، عراق، کویت قطر و امارات از همسایگان این شبه جزیره هستند. در فصل تابستان دمای هوا کشور عربستان به بیش از 45 درجه سانتی گراد نیز می‌رسد. عربستان بزرگ‌ترین کشور جهان است که رودخانه ندارد. 95 درصد از وسعت عربستان سعودی را مناطق بیابانی یا نیمه بیابانی تشکیل می دهد.\n" +
            "زبان مردم عربستان عربی است و وضعیت فراگیری زبان انگلیسی در این کشور بسیار پایین است و تقریبا جز آخرین کشورهای دنیا در این زمینه است. \n" +
            "اگر بخواهیم به دانشگاه‌های عربستان اشاره کنیم می‌توانیم دانشگاه نفت و مواد معدنی ملک فهد با رتبه 216 در رتبه‌بندی جهانی، دانشگاه پادشاهی سعودی یا شاه سعود با رتبه‌ی 253 و دانشگاه ملک عبدالعزیز در رتبه 360 را نام ببریم. \n"
    },
    6666: {
        name: "ژاپن",
        image: "japan",
        code: "jp",
        content: "ژاپن معروف کشور آفتاب تابان و شکوفه‌های گیلاس است. ژاپن فرهنگ غنی خاص خودش را دارد. در قرن 16 میلادی به دلیل تاثیراتی که فرهنگ اروپایی روی مردم ژاپن گذاشته بود، قانونی تصویب شد که اجازه‌ی ورود هیچ فرد خارجی‌ای را به ژاپن نمیداد و هر کسی که از کالای اروپایی استفاده می‌کرد تنبیه جریمه میشد. سرانجام پس از 200 سال این قانون ملغی شد و دروازه‌های چین به روی اروپایی‌ها و خارجی‌ها باز شد.\n" +
            "ژاپن به وسیله دریایی با همین نام از ساحل شرقی قاره آسیا جدا شده‌است. روسیه، چین و جمهوری کره نزدیکترین کشورها به ژاپن هستند. ژاپن مجموعه جزایری است که با طول زیاد از شمال به جنوب کشیده شده‌ و از چیزی بیش از ۶۸۰۰ جزیره تشکیل شده‌است. به همین خاطر آب و هوای مناطق گوناگون آن به شدت با یکدیگر تفاوت دارند و چهار فصل است.\n" +
            "زبان مردم ژاپن «ژاپنی» است. این زبان اگرچه بسیاری لغات را از زبان چینی گرفته ‌است، ولی با این وجود با زبان چینی هم‌ریشه نبوده و کاملاً متفاوت هستند. زبان انگلیسی جایگاهی در این کشور ندارد و مردم آن به ندرت با این زبان آشنایی دارند.\n" +
            "ژاپن دارای دانشگاه‌هایی با رتبه‌های جهانی بسیار عالی است. پنج دانشگاه این کشور در میان لیست صد دانشگاه برتر جهان دیده می‌شود. برای مثال  می‌توان به دانشگاه توکیو با رتبه 23، دانشگاه کیوتو با رتبه 35 و دانشگاه اوساکا با رتبه 67 در رتبه‌بندی جهانی اشاره کرد.\n"
    },
    4444: {
        name: "استرالیا",
        image: "australia",
        code: "au",
        content: "اولین افرادی که به این کشور مهاجرت کرده‌اند حدود 40 تا 60 هزار سال پیش وارد این کشور شده‌اند. این افراد بومیان این منطقه شدند و فرهنگ آنها یکی از قدیمی‌ترین‌ فرهنگ‌ها در کره زمین است. این کشور از ابتدا چند فرهنگی بود! اولین مهاجران به این کشور افرادی از آلمان، نروژ، فرانسه، پرتغال، سوئد و هلند بودند. \n" +
            "براساس گزارشات شهر ملبورن، قابل زیست ترین شهر برای زندگی در جهان است و هیچ فقیر و نیازمندی در آن دیده نمی‌شود، این به آن معناست که استاندارد زندگی در شهر ملبورن به اندازه ای بالاست که هیچ جای دیگری برای زندگی کردن در این کره ی خاکی بهتر از این شهر نیست.\n" +
            "قاره اقیانوسیه با مساحتی حدود 6/7 میلیون کیلومتر مربع در مقایسه با سایر قاره ها به عنوان کوچک ترین قاره شناخته شده است. کشور استرالیا نیز در این قاره واقع شده است. استرالیا زمینی هموار است که از سمت شرق به رشته کوه های جداکننده می رسد. از جمله کشورهایی که به استرالیا نزدیک است می توان از سمت شمال غرب به اندونزی، جنوب شرق به نیوزلند و از شمال شرق به گینه نو اشاره کرد. کشور استرالیا به همراه کشورهای نام برده و چند جزیره پراکنده دیگر که در اقیانوس آرام قرار گرفته اند قاره اقیانوسیه را تشکیل می دهند. محدوده آب و هوایی استرالیا بسیار وسیع است، از آب و هوای خشک تا نیمه خشک در مرکز تا نواحی گرمسیری و موسمی در شمال تا آب و هوای معتدل در شرق و جنوب. استرالیا زبان رسمی ندارد ، اما اکثر مردم زبان انگلیسی را به عنوان زبان اول خود انتخاب کرده اند.براساس سرشماری سال 2016 ، 73٪ از مردم استرالیا فقط در خانه انگلیسی صحبت می کنند. انگلیسی استرالیایی، لهجه و واژگان متمایز دارد.\n" +
            " برترین دانشگاه های استرالیا در بین ۲۰ دانشگاه جهان قرار گرفته و بقیه آن ها در بین۴۰۰ دانشگاه برتر جهان قرار گرفته اند. می‌توان در این بین به دانشگاه‌های ملی استرالیا با رتبه 20 در رتبه‌بندی جهانی، دانشگاه ملبورن با رتبه 41 و دانشگاه سیدنی با رتبه 50 اشاره کرد.\n"
    },
    2114: {
        name: "ایتالیا",
        image: "italy",
        code: "it",
        content: "ایتالیا بزرگترین تولیدکننده‌ی شراب جهان، مهد پیتزا، پاستا و اسپرسو، کشوری با نرخ پایین تولد و جمعیتی پیر است. قدیمی‌ترین دانشگاه اروپا، دانشگاه بولونیا است که قدمت آن به سال 1088 میلادی برمی‌گردد. صدمه زدن به گربه‌ها در این کشور جرم است و مجازات سنگینی در پی دارد. در میان مردم اروپا، ایتالیایی‌ها با خرافاتی بودن مشهورند. مثلا این باور در ایتالیا رایج است که شنیدن صدای عطسه‌ی گربه، خوش‌یمن است.\n" +
            "ایتالیا کشوری در اروپای جنوبی و پایتخت آن شهر تاریخی رم است. این کشور یکی از قدرت‌های اصلی اقتصادیِ جهان و هشتمین اقتصاد بزرگ جهان است. این کشور از شبه‌جزیره ایتالیا و دو جزیره‌ی سیسیل و ساردِنی در دریای مدیترانه تشکیل شده‌است. کشور ایتالیا به دلیل شکل ظاهری قلمرو آن به کشور چکمه معروف است.\n" +
            "زبان‌های رایج در ایتالیا هم تقریباً همگی شاخه‌هایی از زبان رومی به‌شمار می‌روند. با وجود اینکه زبان رسمی ایتالیا زبان ایتالیایی است اما زبان‌های دیگری نیز در این کشور وجود دارند که حالتی نیمه‌رسمی و گاه محلی دارند. ایتالیا در میان کشورهای اروپایی، جز آخرین کشورها به لحاظ نفوذ و فراگیری استفاده از زبان انگلیسی است.\n" +
            "به دلیل امتداد طولی زیاد ایتالیا و کوهستانی بودن آن، آب و هوای این کشور بسیار متنوع است. در بیشتر مناطق شمالی و مرکزی، آب و هوا از نیمه گرمسیری مرطوب تا اقیانوسی در تنوع است. \n" +
            "بیشتر مناطق جنوبی دارای آب و هوای مدیترانه‌ای است مناطق ساحلی دارای زمستان‌های معتدل و تابستان‌های گرم و به طور کلی خشک است. دمای متوسط زمستان از صفر درجه سانتیگراد در آلپ تا دوازده درجه سانتیگراد در سیسیل متغیر است. دمای متوسط تابستان نیز از 20 درجه سانتیگراد تا بیش از 25 درجه سانتیگراد  است.\n" +
            "پلی‌تکنیک میلان، دانشگاه ساپینزا (رم)، پلی‌تکنیک تورین و دانشگاه بولونیا از جمله دانشگاه‌های مطرح ایتالیا هستند. اخیرا ایتالیا به خاطر بورسیه‌های استانی مورد توجه دانشجویان ایرانی قرار گرفته است.\n"
    },
    1114: {
        name: "اسپانیا",
        image: "spain",
        code: "es",
        content: "یکی از عادات جالب و عجیب مردم اسپانیا، صحبت کردن با صدای بلند است. صدای بلند قسمتی از شخصیت اسپانیایی‌هاست. مورد جالب دیگری در مورد این کشور قانونی بودن برهنگی است. مردم اسپانیا به خوش‌گذرانی معروفند و بالاترین نرخ فراغت در روز را دارند. \n" +
            "اسپانیا در شبه جزیره ایبری واقع در اروپای غربی و عضو اتحادیه اروپا است. سرزمین اصلی اسپانیا از جنوب و شرق با دریای مدیترانه و جبل الطارق، از شمال و شمال شرق با فرانسه، آندورا و از غرب و شمال غرب با پرتغال و اقیانوس اطلس هم‌مرز است. مرز اسپانیا با پرتغال «به طول ۱۲۱۴ کیلومتر» طولانی‌ترین مرز یکپارچه در اتحادیه اروپا است.\n" +
            "قلمروی اسپانیا افزون بر سرزمین اصلی شامل جزایر بالئارس در دریای مدیترانه، جزایر قناری در سواحل آفریقایی اقیانوس اطلس، دو شهر خودمختار در آفریقای شمالی هم‌مرز با کشور مراکش و چندین جزیره مسکونی و غیر مسکونی است.\n" +
            "زبان رسمی مردم اسپانیا، اسپانیایی است. اسپانیایی زبان مادری ۴۸۳ میلیون نفر شناخته می‌شود و تعداد کل سخنوران این زبان به ۵۷۰ میلیون نفر می‌رسد. اسپانیا در میان کشورهای اروپایی، جز آخرین کشورها به لحاظ نفوذ و فراگیری استفاده از زبان انگلیسی است.\n" +
            "در اسپانیا هر سه آب و هوای اقیانوسی، نیمه‌خشک و مدیترانه‌ای وجود دارد. در اقلیم نیمه‌خشک برخلاف اقلیم مدیترانه‌ای فصل خشک پس از زمستان نیز ادامه دارد. در حالی که در اقلیم مدیترانه‌ای تابستان‌های گرم و خشک حکمفرماست، در اقلیم اقیانوسی دما در زمستان و تابستان تحت تأثیر اقیانوس تغییر می‌کند و هیچ فصل خشکی وجود ندارد.\n" +
            "دانشگاه مادرید، دانشگاه بارسلونا و دانشگاه نابارا از جمله بهترین دانشگاه‌های اسپانیا هستند. تحصیل در اسپانیا به زبان اسپانیولی در دانشگاه‌های دولتی رایگان است. اگرچه دانشگاه‌های متعددی نیز برای تحصیل به زبان انگلیسی در اسپانیا وجود دارد.\n"
    },
    3114: {
        name: "فرانسه",
        image: "france",
        code: "fr",
        content: "مردم فرانسه عاشق خواب هستند و به طور میانگین 8.83 ساعت در روز را به خوابیدن اختصاص می‌دهند. نکته‌ی جالب دیگری که در مورد فرانسه وجود دارد، اهدای مدال از طرف دولت به والدینی است که فرزندان خود را خوب پرورش دهند. این مدال که مدال خانواده‌ی فرانسوی نام دارد، طی مراسمی و هرساله به واجدین شرایط اهدا می‌شود.\n" +
            "فرانسه یکی از کشورهای اروپای غربی است که دارای قلمروهای زیادی در آنسوی دریاهاست. فرانسه سواحلی در دریای مدیترانه و در اقیانوس اطلس دارد. به دلیل شکل نقشه این کشور، در زبان فرانسوی به هگزاگون یا شش ضلعی معروف است. فرانسه از جنوب با آندورا و اسپانیا، از شرق با ایتالیا و سوئیس و آلمان و لوکزامبورگ و بلژیک، از جنوب با موناکو مرز زمینی دارد. همچنین از طریق کانال مانش با انگلستان ‌مرز است.\n" +
            "بخش‌های شمالی و شمال شرقی فرانسه دارای آب‌وهوای معتدل است. بخش‌های جنوبی نیز آب‌وهوای مدیترانه‌ای دارند. بخش‌های غربی فرانسه دارای اقلیم اقیانوسی است؛ یعنی این مناطق دارای میزان بارش بالایی بوده و زمستان‌هایی معتدل و تابستان‌هایی گرم را تجربه می‌کنند. شرق این کشور داری آب و هوای کوهستانی است. سایر مناطق نیز معمولاً از تابستان‌هایی گرم و گاهی طوفانی و زمستان‌هایی سرد برخوردارند.\n" +
            "زبان اصلی مردم فرانسه، فرانسوی است اما درصد کمی از مردم در مناطق مرزی به زبان‌هایی نظیر کاتالان، باسکی و فلمیش صحبت می‌کنند. به نسبت سایر مردم اروپا، میزان فراگیری زبان انگلیسی در بین مردم فرانسه متوسط است.\n" +
            "آموزش عالی در فرانسه توسط دانشگاه‌های عمومی و مدارس معتبر و انتخابی انجام می‌شود. این مدارس که به  Grande école معروف هستند، بسیار رقابتی بوده و فارغ‌التحصیلان مشهوری دارند. برخلاف دانشگاه‌های عمومی که دانشکده‌های متعددی دارند، مدارس گرند اکوله، در زمینه‌ای محدود و با تعداد دانشجویان کم فعالیت می‌کنند.\n" +
            "دانشگاه سوربن، پلی‌تکنیک فرانسه و دانشگاه علوم و ادبیات پاریس از جمله مشهورترین دانشگاه‌های فرانسه هستند.\n"
    },
    2223: {
        name: "بلژیک",
        image: "belgium",
        code: "be",
        content: "بلژیکی‌ها علاقه‌ی زیادی به ساختن یا خریدن خانه دارند و هر بلژیکی در اولین فرصتی که بتواند، برای خودش یا خانه می‌خرد یا می‌سازد. به همین خاطر بین مردم بلژیک این جمله رایج است که «هر کسی با یک آجر در شکمش به دنیا می‌آید». از طرفی صحبت کردن در مورد پول خیلی مناسب نیست و به نوعی تابو محسوب می‌شود. البته صبحت در مورد مالیات بین آن‌ها رایج است، زیرا که نرخ مالیات در بلژیک بسیار بالاست.\n" +
            "بلژیک کشوری در غرب اروپا و یکی از اعضای اتحادیه اروپا است که پایتخت آن بروکسل است.\n" +
            "از شمال با هلند، در شرق با آلمان، در جنوب شرقی با لوکزامبورگ، در جنوب با فرانسه و از شمال غربی با دریای شمال مجاور است. خط جدایی فرهنگی ژرمن‌ها و رومی‌زبانان از میانه‌های کشور بلژیک می‌گذرد. آب و هوای بلژیک، معتدل دریایی و میزان بارندگی زیاد است. در ژانویه میانگین دما ۳درجه است و در جولای به ۱۸ می‌رسد.\n" +
            "در شصت درصد از مناطق بلژیک، زبان هلندی و در چهل درصد دیگر (عمدتا مناطق جنوبی) فرانسوی صحبت می‌شود. در بروکسل هر دو زبان در نهادهای دولتی رایج است. کمتر از یک درصد مردم بلژیک آلمانی‌زبان هستند و در شرق کشور زندگی می‌کنند. با این‌حال بسیاری از مردم بلژیک توانایی تکلم به زبان انگلیسی را دارند و بلژیک جز ده کشور برتر اروپا به لحاظ گستردگی استفاده از زبان انگلیسی است.\n" +
            "یکی از 100 دانشگاه برتر جهان، دانشگاه KU Leuven است که در کنار Ghent University و University of Antwerp بهترین دانشگاه‌های بلژیک محسوب می‌شوند.\n"
    },
    3343: {
        name: "ایرلند",
        image: "ireland",
        code: "ie",
        content: "در این کشور هیچ ماری وجود ندارد، پس با خیال راحت در طبیعت سبز آن قدم بزنی! افسانه‌ای هست که می‌گوید پاتریک مقدس تمام مارها را از این سرزمین تبعید کرده است. ایرلندی‌ها تبعید مارها و گذرگاه غول‌ها را باور می‌کنند ولی اگر از سفینه فضایی با آن‌ها صحبت کنید، شما را دیوانه می‌خوانند. ایرلند کمترین تعداد گزارش دیدن سفینه در اروپا را دارد، پس داستان تخیلی سفینه‌ها را پیش خود نگه دارید یا این که در جمع به شما می‌خندند.\n" +
            "ایرلند در شمال غربی اروپا قرار دارد. این کشور به دو بخش ایرلند شمالی و ایرلند جنوبی تقسیم شده است. این کشور با یک مرز خاکی در شمال شرقی از ایرلند شمالی جدا شده است. در بخش غربی این کشور اقیانوس اطلس دیده می شود و در بهش جنوبی آن نیز دریای کلتی قرار دارد. ایرلند آب و هوای معتدل اقیانوس دارد. زمستان به لطف جریانهای گرم جریان خلیج فارس ، معتدل است و دمای هوا پایین تر از 4 درجه سانتیگراد نیست. بارش برف در این کشور بسیار نادر است اما باران ها در هر زمان از سال مکرر و طولانی است.\n" +
            "زبان رسمی کشور ایرلند یا همان زبان ایرلندی تنها زبانی می باشد که در ایرلند استفاده می شود و از خود جزیره ایرلند ریشه گرفته است و بقیه زبان ها از خارج به ایرلند وارد شده است. زبان انگلیسی از قرن نوزدهم زبان اول و مسلط در ایرلند بوده است و تنها جمعیت اندکی در ایرلند زبان ایرلندی را زبان اول خود می دانند.\n" +
            "در این کشور ثبات اقتصادی خوبی دیده می شود به طوریکه رتبه کشور ایرلند در زمینه رتبه های اقتصادی در دنیا 9 اعلام شده است.  تحصیلات در کشور ایرلند بر پایه استعداد افراد شکل می گیرد به طوریکه در ابتدا استعداد فرد مشخص می شود و طبق استعداد خود ورود به رشته مشخص خواهد کرد.\n" +
            "اگر بخواهیم به دانشگاه‌های این کشور اشاره کنیم می‌توان کالج ترینیتی دوبلین با رتبه 164 در رتبه‌بندی جهانی، کالج دانشگاهی دوبلین با رتبه 201 و دانشگاه ملی ایرلند، گالوی با رتبه 300 را نام برد.\n"
    },
    3333: {
        name: "هلند",
        image: "netherlands",
        code: "nl",
        content: "به ازای هر نفر 1.3 دوچرخه در هلند هست و ۱۵ هزار کیلومتر مسیر دوچرخه سواری در آن وجود دارد. هلند کشوری بسیار امن است. در سال 2013، به دلیل کاهش جرم و جنایت، هشت زندان به طور کامل بسته شد. برخی از این زندان‌ها امروزه به هتل تبدیل شده‌اند. مصرف ماریجوانا در کافه‌های هلند مشکلی ندارد، در حالی که استعمال تنباکو به شدت ممنوع است.\n" +
            "هلند تنها با آلمان و بلژیک مرز مشترک دارد. این کشور بزرگترین صادر کننده گل در جهان و ششمین کشور شاد دنیا است. هلند سرزمینی کم‌ارتفاع و هموار است و اغلب با وزش باد و نسیم همراه است.\n" +
            "زبان رسمی این کشور هلندی است، که شاخه‌ای از زبان‌های ژرمن محسوب شده و به آلمانی شباهت‌هایی دارد. نکته قابل ملاحظه در ارتباط با مردم این کشور، تسلط آن ها بر زبان انگلیسی است. براساس گزارش اتحادیه اروپا، ۹۴% از مردم هلند قادرند به زبان انگلیسی صحبت کنند که از متوسط کل اروپا (۵۴%) بسیار بالاتر است. از هر ۱۰ هلندی، ۹ نفر به زبان انگلیسی مسلط است. \n" +
            "13 دانشگاه این کشور جز 1000 دانشگاه برتر دنیا هستند. دانشگاه دلفت و آمستردام از معروف‌ترین دانشگاه‌های این کشور هستند. \n"
    },
    1343: {
        name: "آمریکا",
        image: "usa",
        code: "us",
        content: "کشور آمریکا در نیمکره غربی زمین قرار گرفته است در بخش شمال قاره آمریکا قرار دارد. این کشور دارای 48 ایالت به شکل همجوار است که البته دو ایالت جدا از بخش های دیگر در نظر گرفته شده است. آلاسکا بزرگترین ایالت کشور آمریکا است و رود آیلند کوچکترین ایالت در کشور آمریکا محسوب می شود. این کشور سومین کشور پهناور جهان است و از لحاظ نژادی و گوناگونیِ مردم، متنوع‌ترین کشور جهان را داراست. سومین کشور پرجمعیت و چهارمین کشور پهناور دنیاست.\n" +
            "کشور آمریکا از نظر وسعت بزرگ بوده و آب و هوای کشور آمریکا نیز بسیار متنوع است. آب و هوای این کشور در وضعیت کلی معتدل است به طوری که بخش های فلوریدا و هاوایی دارای آب و هوای استوایی است. دشت های بزرگ این کشور دارای یک فضای نیمه خشک است به طوری که در بخش های جنوب غربی آن آب و هوای خشک دیده می شود. درجه حرارت در بخش آلاسکا به منفی 62 نیز رسیده است. بخش های شمالی کشور آمریکا بسیار سرد هستند و زمستان های یخبندان و سوزناکی دارد.\n" +
            "همانطور که احتمالا شنیده اید، در حال حاضر هزاران دانشجوی ایرانی مشغول به تحصیل در بهترین دانشگاه های آمریکا هستند. ایران در بین کشورهایی با بیشترین تعداد دانشجو در کشور آمریکا، رتبه 22 را دارد. کشور آمریکا با سطح علمی فوق العاده، بهترین دانشگاه های جهان را در خود جای داده است. تعداد زیادی از دانشگاه های برتر و دارای رتبه بالا در آمریکا به عنوان دانشگاه های خصوصی طبقه بندی شده اند. از جمله دانشگاه هاروارد ، موسسه فناوری ماساچوست ، دانشگاه استنفورد و دانشگاه ییل.\n"
    },
    1422: {
        name: "آلمان",
        image: "germany",
        code: "de",
        content: "غذا، سوسیس، جدیت مردم، پیاده‌روی، قلعه‌ها و مهمانی‌ها از جمله‌ی جاذبه‌های این کشور هستند. هنر زنده و موسیقی در شهر، کلیسا‌ های جامع، قلعه‌ ها، جنگل‌ های زیبا در غرب، کوه‌ های آلپ در جنوب و شهر‌ های تاریخی در سراسر کشور، مکان‌ های دیدنی این کشور هستند.\n" +
            "آلمان کشوری است که در قلب اروپا قرار دارد و با کشورهای دانمارک، هلند، بلژيک، فرانسه، سوئيس، اتريش، جمهوری چک و لهستان همسايه می باشد. زبان رسمی اين کشور آلمانی است و اکثر مردم به زبان انگليسی آشنايي دارند. از نظر وضعیت جغرافیایی، آلمان از دریای شمال و بالتیک تا رشته‌ کوه‌ های آلپ در جنوب به پنج ناحیه بزرگ تقسیم می‌شوند: سرزمین‌های پست در شمال، رشته‌ کوه‌های میانه، دامنه‌ های کم‌ ارتفاع کوه‌ های میانه در جنوب غربی، دامنه‌ های کوه‌ های آلپ و کوه‌ های آلپ در باواریا.\n" +
            "آلمان آب و هوای معمولی و معتدل دارد. با این وجود، با توجه به گسترش شرق به غرب و گسترش قابل توجه جنوب-شمال و همچنین رشته کوههای بسیار زیاد، اختلافات اقلیمی منطقه ای قابل توجهی وجود دارد.\n" +
            "آلمان دارای برترین دانشگاه‌ها در سطح جهان است که شرایط خوبی را برای دانشجوبان بین‌المللی فراهم می‌کند. دانشگاه فنی مونیخ با رتبه 50 در QS، دانشگاه ودویگ ماکسیمیلیان مونیخ با رتبه 63 و دانشگاه روپرشت کارلز هایدلبرگ با رتبه 64 جز برترین دانشگاه‌های این کشور هستند.\n"
    },
    1342: {
        name: "انگلیس",
        image: "england",
        code: "gb",
        content: "روستای Llanfairpwllgwyngyllgogerychwyrndrobwllllantysiliogogogoch با تلفظ «شنفرپوشگوین‌گیش‌گوگریخوئیرندروبوشنتیسیلیوگوگوگوخ» روستایی در جزیره ولز است و در کتاب رکورد گینس به عنوان طولانی‌ترین نام در بریتانیا شناخته شده است.\n" +
            "انگلیس در سواحل شمال‌غربی اروپا و شامل دو جزیره اصلی است اسکاتلند، ولز و انگلیس در یک جزیره و ایرلند شمالی در جزیره‌ی دیگر قرار گرفته است.\n" +
            "این کشور با کانال مانش از فرانسه در جدا می‌شود. آب و هوایی نسبتا سرد دارد و پایتخت آن، لندن، لقب شهر مه‌آلود را با خود یدک می‌کشد. در انگلستان باران زیاد می‌بارد و هوا در بسیاری مواقع ابری است، اما باید بدانید که لندن از رم، نیویورک، ریودوژانیرو و توکیو خشک‌تر است! انگلیس از نظر سیستم حمل‌و‌نقل جزو کشورهای برتر دنیاست و متروی شهر لندن گسترده‌ترین متروی جهان است.\n" +
            "بریتانیا زادگاه نیوتن، داروین، شکسپیر و بیتلز است. ثروتمند‌ترین باشگاه فوتبال دنیا یعنی منچستر یونایتد، بزرگترین بازار ارز جهان و مهد رمان هری‌پاتر است.ا\n" +
            "انگلیسی‌زبان رسمی این کشور است که توسط ۹۸ درصد از مردم صحبت می‌شود. البته گویش‌های مختلفی هم در آن وجود دارد. زبان‌های منطقه‌ای مانند ایرلندی، اسکاتلندی و ولزی هم وجود دارند که مورد آخری، یکی از پرمصرف‌ترین زبان‌های منطقه‌ای به‌حساب می‌آید. \n" +
            "دانشگاه آکسفورد قدیمی‌ترین موسسه آموزش عالی در کل انگلیس است. جالب است بدانید که تا سال ۱۸۷۷ اساتید این دانشگاه مجاز به ازدواج نبودند. در فهرست صد دانشگاه برتر دنیا، 18 دانشگاه متعلق به بریتانیا است. دانشگاه کمبریج، ایمپریال کالج، ادینبرگ و UCL هم از دانشگاه‌های به نام دنیا هستند. \n"
    },
    4432: {
        name: "دانمارک",
        image: "denmark",
        code: "dk",
        content: "پرچم کشور دانمارک زمینه‌ای قرمز با یک صلیب سفید رنگ است. بر طبق افسانه‌های قدیمی از دوران شاه والدرمار دوم، اولین پرچم دانمارک از آسمان نازل شده است. در آن زمان شاه والدرمار دوم در جنگ با ارتش استونی در تنگنا قرار گرفته بود به طوری که شکست ارتش دانمارک در این نبرد حتمی بود. در آن زمان بود که بزرگان دانمارک بر روی تپه‌ای گرد هم جمع شدند و دعا خواندند. در همین بین ابرها کنار رفتند و پارچه‌ای قرمز رنگ که بر روی آن صلیب سفید رنگی نقش بسته بود از آسمان به زمین افتاد. همین موضوع باعث تجدید قوای ارتش دانمارک شد و در نتیجه جنگجویان شاه والدرما دوم توانستند ارتش استونی را مغلوب کرده و کشور آن‌ها را تصرف کنند. این گونه بود که پرچم دانمارک شکل گرفت.\n" +
            "دانمارک با نام رسمی پادشاهی دانمارک یکی از مرفه‌ترین کشورهای اروپا و از کوچکترین کشورهای حوزه اسکاندیناوی است. دانمارک کشوری امن و آرام با جاذبه‌های طبیعی و گردشگری فراوان است.\n" +
            "زبان رسمی این کشور، دانمارکی و از خانواده زبان‌های هند و اروپایی است. دانمارکی از شاخه زبان‌های ژرمنی است، اما گویش مردم آن بیشتر مشابه سوئدی و نروژی است. \n" +
            "جالب است بدانید که طی تحقیقات یونسکو، مردم دانمارک شادترین مردم جهان هستند و این کشور توانسته در طی سالیان متمادی مقام اول را در رضایتمندی مردم از زندگی دریافت کند.\n" +
            "دانمارک آب و هوایی معتدل دارد که علت آن هم وزش بادهای غربی و وجود دریاست که این کشور را احاطه کرده است. ژانویه از سردترین ماه‌های سال و اوت از گرمترین ماه‌های سال در این کشور است.\n" +
            "از جمله دانشگاه‌های مطرح این کشور می‌توان به دانشگاه کوپنهاگن با رتبه 84 در رتبه‌بندی جهانی، دانشگاه آرهاس با رتبه 106 و دانشگاه فنی دانمارک با رتبه 187 اشاره کرد.\n"
    },
    2122: {
        name: "اتریش",
        image: "austria",
        code: "at",
        content: "آرنولد شوارتزنگر، موتزارت، فروید، مخترع چرخ خیاطی، نوشیدنی ردبول، فردیناند پورشه خالق اتوموبیل پورشه همگی اتریشی هستند. در اتریش نیز خدمت سربازی برای همه‌ی مردان اجباری است که البته زمان آن کمتر از یک سال است.\n" +
            "اتریش کشوری محصور در خشکی واقع در اروپای مرکزی است. پایتخت آن وین  است. این کشور از شمال با آلمان و جمهوری چک، از شرق با اسلواکی و مجارستان، از جنوب با ایتالیا و اسلوونی و از غرب با سوئیس و لیختنشتاین هم‌مرز است.\n" +
            "زبان رسمی اتریش آلمانی است. نود و هشت درصد مردم این کشور به این زبان صحبت می‌کنند. در کنار آلمانی، اقلیتی به زبان‌های کروات، اسلوونیایی و مجارستانی صحبت می‌کنند. با این حال زبان انگلیسی در بین مردم اتریش بسیار فراگیر است. اتریش رتبه‌ی 6 را در بین کشورهای غیر انگلیسی زبان اروپا از لحاظ فراگیری و کاربرد این زبان دارد.\n" +
            "قسمت عمده‌ای از اتریش در منطقه آب و هوای خنک و معتدل قرار دارد، جایی که وزش بادهای مرطوب غربی غالب است. حدودا سه چهارم اتریش دارای آب و هوای آلپی است. اگرچه اتریش در زمستان سرد است (تا منفی ده درجه) ، دمای تابستان می‌تواند نسبتاً بالا باشد.\n" +
            "دانشگاه وین از قدیمی‌ترین دانشگاه‌های اروپایی است که اساتید معروفی مثل شرودینگر، ماخ، بولتسمان، کپلر و هانس فیشر داشته است. دانشگاه صنعتی وین و دانشگاه اینسبروک از جمله دیگر دانشگاه‌های معتبر اتریش هستند.\n"
    },
    4211: {
        name: "سوئیس",
        image: "switzerland",
        code: "ch",
        content: "سوئیس کشور شکلات، ساعت، انیشتین و اسکی است. داشتن اسلحه در سوئیس مانند آمریکا آزاد است، اما نرخ جرم و جنایت در این کشور بسیار پایین است. سوئیس به لحاظ کیفیت زندگی در رده‌ی بسیار بالایی قرار گرفته است. هزینه‌ی زندگی در سوئیس بالاست اما سرانه‌ی درآمد نیز بالاست. خودکشی در این کشور قانونی است و به نوعی سوئیس را به مقصدی برای افرادی که قصد خودکشی دارند تبدیل کرده است. \n" +
            "نزدیک به 70% سوئیس را منطقه‌ کوهستانی آلپ فرا گرفته است و راهی به دریا ندارد. سوئیس توسط کشورهای فرانسه، آلمان، ایتالیا، اتریش و لیختن‌‌اشتاین احاطه شده است. سوئیس دارای سابقه‌ی طولانی بی‌طرفی در مناسبات جهانی است، به‌طوری‌که این کشور از سال ۱۸۱۵ تاکنون وارد هیچ جنگی نشده‌است.\n" +
            "زبان‌های رسمی سوئیس فرانسوی، آلمانی و ايتاليايی است. میزان فراگیری زبان انگلیسی نزد مردم سوئیس نه چندان بالا اما خوب است.\n" +
            "دانشگاه‌های سوئیس سطح بالایی دارند. سه دانشگاه از دانشگاه‌های سوئیس در لیست صد دانشگاه برتر جهان هستند که یکی از آن‌ها (دانشگاه ETH) رتبه 6 را داراست.\n" +
            "برای گرفتن تابعیت سوئیس باید حداقل 12 سال در این کشور زندگی کرده باشید. همچنین خدمت سربازی نیز در این کشور برای مردان اجباری است، اما زنان نیز می‌توانند در آن شرکت کنند.\n"
    },
    3231: {
        name: "سوئد",
        image: "sweden",
        code: "se",
        content: "در مرز سوئد و فنلاند، یک زمین گلف وجود دارد که نیمی از سوراخ‌ها در زمین سوئد، و نیمی دیگر در زمین فنلاند است. اکانت رسمی کشور سوئد در توییتر، هر هفته به طور تصادفی، به یکی از شهروندان سوئد سپرده می‌شود تا علایق و نوشته‌های خود را منتشر کند. بازیافت یکی از ارکان اصلی این کشور است. 99 درصد پسماند تولیدی از طرق مختلف بازیافت می‌شود.\n" +
            "کشور سوئد در شمال اروپا و شبه جزیره اسکاندیناوی واقع شده است، که در گذشته‌های دور قلمروی وایکینگ‌ها بوده است. با توجه به موقعیت جغرافیایی آن، اگرچه تابستان کوتاهی دارد اما از آب و هوای مناسبی برخوردار است.\n" +
            "زبان رسمی مردم این کشور، زبان سوئدی است. زبان سوئدی نزدیک به زبان‌های نروژی و دانمارکی است. علاوه بر این، بخش اعظم جمعیت این کشور به زبان انگلیسی مسلط هستند. \n" +
            "کشور سوئد را نیز می توان مانند کشورهای نروژ و دانمارک، به عنوان یک کشور چند فرهنگی در نظر گرفت. یک پنجم کودکان در این کشور، از پدر و مادری خارجی متولد شده‌اند. سوئدی‌هایی که فرزندی به دنیا می‌آورند 16 ماه کمک هزینه از دولت دریافت می‌کنند.  \n" +
            "دانشگاه لوند و KTH سوئد جز صد دانشگاه برتر دنیا هستند. دانشجویان در دانشگاه kth سوئد، به هر میزان که علاقمند باشند، می‌توانند در آزمون یک درس شرکت کنند تا حداکثر نمره را کسب کنند.\n" +
            "گذرنامه سوئد، در کنار گذرنامه‌های بریتانیا، فنلاند و آلمان، از معتبرترین گذرنامه‌های جهان است که دارنده آن می‌تواند بدون ویزا به اکثر کشورهای جهان سفر کند. دانشجویان دکتری در سوئد می‌توانند پس از پایان تحصیلات برای دریافت اقامت اقدام کنند.\n"
    },
    2231: {
        name: "فنلاند",
        image: "finland",
        code: "fi",
        content: "فنلاند لقب شادترین کشور دنیا را دارد. تعداد سوناها در فنلاند بیشتر از تعداد ماشین‌های این کشور است. احوال‌پرسی در فنلاند با دست دادن و ارتباط چشمی همراه است. و دست دادن اغلب کوتاه، محکم و بدون حرکات اضافی است. احوال‌پرسی با کودکان اغلب با به آغوش کشیدن آن‌ها همراه است. روبوسی در کشور فنلاند کمتر دیده می‌شود.\n" +
            "فنلاند تنها سه همسایه دارد. روسیه از شرق، نروژ از شمال و سوئد از غرب با این کشور همسایه هستند. از جنوب نیز از طریق دریا به استونی می‌رسد. تابستان فنلاند بسیار درخشنده و گرم و کوتاه و زمستان آن بسیار تاریک، سرد و طولانی است. در لاپلند در شمال فنلاند به مدت دو ماه تمام در زمستان خورشید طلوع نمی‌کند و در تابستان نیز دو ماه غروب آفتاب وجود ندارد. البته به علت نامساعد بودن آب و هوای شمال فنلاند، جمعیت بسیار کمی در این مناطق زندگی می‌کند. \n" +
            "زبان رسمی مردم فنلاند دو زبان فنلاندی و سوئدی است. زبان فنلاندی یکی از دشوارترین زبان‌های دنیاست و به همین خاطر به آن زبان جن و پری هم می‌گویند. در این زبان ۴۰ مترادف برای واژه‌ی «برف» وجود دارد. همچنین با کلمه‌های متعددی می‌توانید بگویید: «لطفا!» با این حال رتبه‌ی را از لحاظ فراگیری زبان انگلیسی در میان کشورهای غیرانگلیسی زبان دارند و بسیاری از مردم قادرند به این زبان صحبت کنند.\n" +
            "رتبه کشور فنلاند در بهداشت و درمان بسیار بالا است و سرانه‌ی مطالعه‌ی بالایی دارد. تمامی مراکز خرید و مراکز تفریحی دارای مکان اختصاصی برای سگ‌ها هستند.\n" +
            "9 دانشگاه فنلاند رنکینگ زیر 1000 دارند. دانشگاه هلسینکی، دانشگاه آلتو، تورکو و اولو هم از جمله بهترین دانشگاه‌های فنلاند هستند.\n"
    },
    4421: {
        name: "نروژ",
        image: "norway",
        code: "no",
        content: "این کشور در ابتدا نوردوگ (Nordweg) نامیده می شده که به معنی راه شمالی است و شیر به عنوان نماد ملی آن می باشد.\n" +
            "نروژ یک کشور کوهستانی است که آب‌و هوای بسیار سردی دارد. این کشور، در بخش شمالی اروپا قرار دارد. نروژ با فنلاند و سوئد هم مرز است. این کشور تمام بخش غربی و بیشتر مناطق شمالی منطقه اسکاندیناوی را در اروپای شمالی در بر میگیرد. \n" +
            "هیچ کشوری به اندازه نروژ در سواحل خود، بریدگی‌های کوچک و بزرگ ندارد، این بریدگی‌ها متعلق به دوران یخچالی است. به دلیل موقعیت جغرافیایی، کشوری سردسیر است. تابستان های شمال این کشور همیشه روشن و روز است زیرا خورشید غروب نمیکند، از طرف دیگر در زمستان ها خورشید هیچ وقت طلوع نمیکند و تنها منبع طبیعی روشنایی ماه، ستاره ها و نور شفق قطبی است که گاهی آسمان را در بر میگیرد. نروژ طبیعتی زیبا اما وحشی و متغییری دارد و کوهنوردی در یک روز آفتابی میتواند به سرعت جای خود را به باران و باد و یا مه غلیظ بدهد. \n" +
            "تقریبا تمامی ساکنین نروژ به زبان انگلیسی نیز صحبت میکنند اما زبان اول آنها نروژی است. طبق آخرین آمارها دولت نروژ جزو ده دولت پاک دنیا قرار دارد (رتبه هفتم). نرخ بیکاری در این کشور زیر یک درصد است که این خود گواهی بر اهمیت مردم و سطح رفاه آنها برای دولت مردان است.\n" +
            "اگر بخواهیم دانشگاه‌های برتر این کشور را نام ببریم باید به دانشگاه اسلو با رتیه 135 در QS، دانشگاه برگن با رتبه 194 و دانشگاه علم و فناوری نروژ با رتبه 360 اشاره کنیم.\n"
    }
};
// for keeping track of the score
var score = {
    way: 0,
    language: 0,
    budget: 0,
    weather: 0,
    food: 0,
    knowledge: 0
};
var newCountriesScore = {
    au: 0,
    dk: 0,
    no: 0,
    de: 0,
    ie: 0,
    us: 0,
    nl: 0,
    gb: 0,
    ch: 0,
    se: 0,
    fi: 0,
    be: 0,
    fr: 0,
    at: 0,
    es: 0,
    it: 0

};
// for keep track of the current question
var currentQn = 0;

// for setting up each of the questions
function setupQuestion() {
  // get the current questions content
  var qn = questions["soal" + currentQn];
  var qnText = document.getElementById("question");
  qnText.innerText = qn.text;
  // update question image
  var imgTag = document.getElementById("questionImage");
  $(imgTag).attr("src", qn.image);
  // updates each of the options for the current question
  for (var i = 0; i < 3; i++) {
      var option = document.getElementById("option" + i);
      var optionImage = document.getElementsByClassName("option-image")[i];
      var optionTitle = option.getElementsByClassName("question-title")[0];
      var optionContent = option.getElementsByClassName("content")[0];
      var optionInput = option.getElementsByTagName("input")[0];
      var qnOption = qn["option" + i];
      optionTitle.textContent = qnOption.title;
      optionContent.innerHTML = qnOption.content;
      $(optionInput).attr("value", qnOption.value);
      $(optionInput).attr("id", "option" + i);
      $(optionImage).attr("src", qnOption.image);
  }
}

// to unselect all of the options
function resetOptions() {
  var btn = document.getElementsByTagName("input");
  btn[0].checked = false;
  btn[1].checked = false;
  btn[2].checked = false;
}

// to select the option that is clicked
function select(element) {
  var btn = element.getElementsByTagName("input")[0];
  btn.checked = true;
  next();
}

// get the next questions, or display result if all questions were answered
function next() {
    var selected = $("input[name=answer]:checked");
    var ans = selected.val();
    var qnn = questions["soal" + currentQn];
    var selectedOption = selected.attr("id").slice(6, 7);
    if (score["way"] != 5) {
        if (ans == 3) {
            ans = Math.floor((Math.random() * 2) + 5);
        }
        var resultParameter = qnn["about"];
        score[resultParameter] = ans;
    } else {
        if (selectedOption == 2) {
            selectedOption = Math.floor((Math.random()*2));
            qqqq = qnn["option" + selectedOption]["related"];
            newCountriesScore["au"] += qqqq["au"];
            newCountriesScore["dk"] += qqqq["dk"];
            newCountriesScore["no"] += qqqq["no"];
            newCountriesScore["de"] += qqqq["de"];
            newCountriesScore["ie"] += qqqq["ie"];
            newCountriesScore["us"] += qqqq["us"];
            newCountriesScore["nl"] += qqqq["nl"];
            newCountriesScore["gb"] += qqqq["gb"];
            newCountriesScore["ch"] += qqqq["ch"];
            newCountriesScore["se"] += qqqq["se"];
            newCountriesScore["fi"] += qqqq["fi"];
            newCountriesScore["be"] += qqqq["be"];
            newCountriesScore["fr"] += qqqq["fr"];
            newCountriesScore["at"] += qqqq["at"];
            newCountriesScore["es"] += qqqq["es"];
            newCountriesScore["it"] += qqqq["it"];
        }
    }
    currentQn = currentQn + 1;
    resetOptions();
    if (currentQn < 6) {
        setupQuestion();
    } else {
        showPage(2);
    }
}



function finalResult(countrySelectedCode = 0) {
var countryResultCode = (score["weather"] * 1000) + (score["budget"] * 100) + (score["food"] * 10) + (score["knowledge"] * 1);
var countryResult = country[countryResultCode];
if(countrySelectedCode == 0) {
    if (score["way"] == 5) {
        var keys = Object.keys(newCountriesScore);
        var candidate = new Array();
        var i;
        for (i = 0; i < keys.length; i++) {
            if (newCountriesScore[keys[i]] == 4) {
                candidate.push(keys[i]);
            }
        }
        if (candidate.length == 0) {
            for (i = 0; i < keys.length; i++) {
                if (newCountriesScore[keys[i]] == 3) {
                    candidate.push(keys[i]);
                }
            }
        }
        if (candidate.length == 0) {
            for (i = 0; i < keys.length; i++) {
                if (newCountriesScore[keys[i]] == 2) {
                    candidate.push(keys[i]);
                }
            }
        }
        if (candidate.length == 0) {
            for (i = 0; i < keys.length; i++) {
                if (newCountriesScore[keys[i]] == 1) {
                    candidate.push(keys[i]);
                }
            }
        }
        var final = candidate[Math.floor(Math.random() * candidate.length)];
        for (const [key, value] of Object.entries(country)) {
            if (value["code"] == final) {
                countryResult = country[key];
                console.log(key);
                countryResultCode = key;
            }
        }

    } else {
        countryResultCode = (score["weather"] * 1000) + (score["budget"] * 100) + (score["food"] * 10) + (score["knowledge"] * 1);
        // get the description of the personality and update the result page
        var countryResult = country[countryResultCode];
    }
} else {
    console.log('test')
    countryResult = country[countrySelectedCode];
    countryResultCode = countrySelectedCode;
    console.log(countryResultCode)
}
    document.getElementById("personality-type").innerText = "پیشنهاد ابرادین برای شما: " + countryResult["name"];
    var polaroidImage = '<div class="polaroidImage"><img src="' + 'src/images/countries/' +countryResult["image"]+ '.jpg" id="country-image"><div class="imageTitle">'+countryResult["name"]+'<img src="https://flagcdn.com/32x24/'+ countryResult["code"] +'.png" id="country-flag"></div> </div>';
    document.getElementById("personality-part-1").innerHTML = polaroidImage + countryResult["content"];
    var telegramShareTxt = "%D9%85%D9%86%20%D8%AF%D8%A7%D8%B1%D9%85%20%D9%85%DB%8C%D8%B1%D9%85%20" + countryResult["name"] + "%20%D8%8C%20%D8%AE%D9%88%D8%A8%DB%8C%20%D8%A8%D8%AF%DB%8C%20%D8%AF%DB%8C%D8%AF%DB%8C%D8%AF%20%D8%AD%D9%84%D8%A7%D9%84%20%DA%A9%D9%86%DB%8C%D8%AF%20%F0%9F%98%82%0A" + "%0A%D8%A7%D8%A8%D8%B1%D8%A7%D8%AF%DB%8C%D9%86%20%DB%8C%D9%87%20%DA%A9%D9%85%D9%BE%DB%8C%D9%86%20%D8%AF%D8%A7%D8%B1%D9%87%20%DA%A9%D9%87%20%D8%A8%D8%A7%20%DA%86%D9%86%D8%AF%D8%AA%D8%A7%20%D8%B3%D9%88%D8%A7%D9%84%20%D8%A8%D9%87%D8%AA%20%D9%85%DB%8C%DA%AF%D9%87%20%DA%A9%D8%AF%D9%88%D9%85%20%DA%A9%D8%B4%D9%88%D8%B1%20%D9%88%D8%A7%D8%B3%D9%87%20%D9%85%D9%87%D8%A7%D8%AC%D8%B1%D8%AA%20%D8%AA%D8%AD%D8%B5%DB%8C%D9%84%DB%8C%20%D8%A8%D9%87%D8%AA%D8%B1%D9%87.%0A15%20%D8%AA%D8%A7%20%D8%B1%D8%B2%D9%88%D9%85%D9%87%E2%80%8C%DB%8C%20%D8%B1%D8%A7%DB%8C%DA%AF%D8%A7%D9%86%20%D9%88%20%DB%8C%D9%87%20%D9%87%D8%AF%DB%8C%D9%87%20%D9%87%D9%85%20%D9%85%DB%8C%D8%AF%D9%87.%20%D8%B1%D9%88%DB%8C%20%D9%84%DB%8C%D9%86%DA%A9%20%D8%A8%D8%A7%D9%84%D8%A7%20%DA%A9%D9%84%DB%8C%DA%A9%20%DA%A9%D9%86%20%D9%88%20%D8%B4%D8%B1%DA%A9%D8%AA%20%DA%A9%D9%86%20%F0%9F%98%8D";
    var ref = Math.floor((Math.random()*9999))+10000;
    var twitterShareTxt =
        "%D8%B7%D8%A8%D9%82%20%D8%AA%D8%AD%D9%82%DB%8C%D9%82%D8%A7%D8%AA%20%D8%A8%D9%87%20%D8%B9%D9%85%D9%84%20%D8%A2%D9%85%D8%AF%D9%87%20%23%D9%85%D9%82%D8%B5%D8%AF%D9%85%D9%86%20"
        + countryResult["name"]
        + "%20%D8%B4%D8%AF%20%F0%9F%98%81%0A%D8%A7%D8%B2%20%D9%84%DB%8C%D9%86%DA%A9%20%D8%B2%DB%8C%D8%B1%20%D8%A8%D8%B1%DB%8C%D8%AF%20%D8%A8%D8%A8%DB%8C%D9%86%D8%AF%20%DA%A9%D8%AC%D8%A7%20%D8%A8%D8%B1%D8%A7%D8%AA%D9%88%D9%86%20%D8%A8%D9%87%D8%AA%D8%B1%D9%87%0A(%D9%88%D8%A7%D8%B3%D9%87%2015%20%D9%86%D9%81%D8%B1%20%D9%87%D9%85%20%D8%B1%D8%B2%D9%88%D9%85%D9%87%20%D8%B1%D8%A7%DB%8C%DA%AF%D8%A7%D9%86%20%D9%85%DB%8C%D9%86%D9%88%DB%8C%D8%B3%D9%86)%0Aabroadin.com%2Fmy-destination%3Fcountry%3D"
        + countryResultCode
        + "%26ref%3D" + ref
        + "%0A%0A%23abroadin%20%23%D9%BE%D8%B0%DB%8C%D8%B1%D8%B4_%D8%AA%D8%AD%D8%B5%DB%8C%D9%84%DB%8C%20%23%D8%AA%D8%AD%D8%B5%DB%8C%D9%84_%D8%AF%D8%B1_"
        + countryResult["name"]
        + "%0A%40abroadin_farsi%20";
    document.getElementById("telegramShareUrl").setAttribute("href", "https://t.me/share/url?url=abroadin.com/my-destination?country="+countryResultCode+"&text=" + telegramShareTxt);
    document.getElementById("twitterShareUrl").setAttribute("href", "https://twitter.com/share?text=" + twitterShareTxt);
    document.getElementById("resultStory").setAttribute("href","src/images/stories/"+countryResult["image"]+".jpg");
    // set question count to 0 so that when the user wishes to retry, the quiz is on the right question count

    currentQn = 0;
    score = {
        way: 0,
        language: 0,
        budget: 0,
        weather: 0,
        food: 0,
        knowledge: 0
    };
    newCountriesScore = {
        au: 0,
        dk: 0,
        no: 0,
        de: 0,
        ie: 0,
        us: 0,
        nl: 0,
        gb: 0,
        ch: 0,
        se: 0,
        fi: 0,
        be: 0,
        fr: 0,
        at: 0,
        es: 0,
        it: 0

    };
    showPage(3);

}

function validateEmail() {
    var mailformat = /^(([^<>()\[\]\\.,;:\s@"]+(\.[^<>()\[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/;
    var inputText = $("#email").val();
    if (inputText.match(mailformat)) {
        finalResult();
    } else {
        console.log("false");
    }
}

function showCountry(fromGoogle) {
    const queryString = window.location.search;
    const urlParams = new URLSearchParams(queryString);
    const returned = urlParams.get('return');

    if(fromGoogle) {
        window.location.href =
        `https://accounts.google.com/o/oauth2/v2/auth?redirect_uri=https://abroadin.com/auth/oauth2/google&state:{"country"=${googleCode}}&prompt=consent&response_type=code&client_id=696364929615-frl6151jgggmi923lu0clb4utsprbodl.apps.googleusercontent.com&scope=https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fuserinfo.email+https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fuserinfo.profile&access_type=offline`
    }
    if(returned == "true") {
        const jsonStateStr =queryString.split("&")[1]
        const jsonStateDecodedStr = jsonStateStr.replaceAll("%22", '"')
        console.log(jsonStateDecodedStr)
        const returnedCountryCode = JSON.parse(jsonStateDecodedStr)['country']
        console.log(returnedCountryCode)
        finalResult(returnedCountryCode);
    }
}

// bring the particular page into view.
// page 0: start page
// page 1: quiz
// page 2: email
// page 3: result
function showPage(num) {
  var pages = document.getElementsByClassName("quiz-step");
  pages[0].style.display = "none";
  pages[1].style.display = "none";
  pages[2].style.display = "none";
  pages[3].style.display = "none";
  pages[num].style.display = "flex";
}

window.addEventListener("load", () => {
    showCountry()
    console.log('onload')
})